from config import DATABASE_URI
from models import *
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker

engine = create_engine(DATABASE_URI)


def recreate_database():
    Base.metadata.drop_all(engine)
    Base.metadata.create_all(engine)


if __name__ == "__main__":
    recreate_database()

    Session = sessionmaker(bind=engine)
    session = Session()
    connection = session.connection().connection
    cursor = connection.cursor()

    # Curriculum
    cursor.executemany(
        '''INSERT INTO "School_schema"."Curriculum"(year_start_date, year_end_date, link_to_the_original, class_number, class_specialization) 
           VALUES(%s, %s, %s, %s, %s)''',
        [
            [date(2018, 9, 1), date(2019, 8, 30), "Ссылка", 5, None],
            [date(2019, 9, 1), date(2020, 8, 30), "Ссылка", 8, None],
            [date(2020, 9, 1), date(2021, 8, 30), "Ссылка", 10, "Физико-математический"],
            [date(2021, 9, 1), date(2022, 8, 30), "Ссылка", 6, None],
            [date(2023, 9, 1), date(2024, 8, 30), "Ссылка", 7, None],
            [date(2022, 9, 1), date(2023, 8, 30), "Ссылка", 10, "Социально-гуманитарный"],
            [date(2022, 9, 1), date(2023, 8, 30), "Ссылка", 11, "Физико-математический"]
        ]
    )

    # Discipline
    cursor.executemany(
        '''INSERT INTO "School_schema"."Discipline"(subject_area, subject_name, discipline_code, hours, curriculum_id) 
           VALUES(%s, %s, %s, %s, %s)''',
        [
            ["Русский язык и литература", "Русский язык", 1, 5 * 36, 1],
            ["Русский язык и литература", "Литература", 18, 3 * 36, 1],
            ["Иностранный язык", "Английский язык", 9, 3 * 36, 1],
            ["Математика и информатика", "Математика", 2, 5 * 36, 1],
            ["Общественно-научные предметы", "История России", 7, 2 * 36, 1],
            ["Общественно-научные предметы", "География", 8, 1 * 36, 1],
            ["Естественно-научные предметы", "Биология", 6, 1 * 36, 1],
            ["Физическая культура", "Физическая культура", 0, 2 * 36, 1],

            ["Русский язык и литература", "Литература", 18, 2 * 36, 2],
            ["Иностранный язык", "Английский язык", 9, 3 * 36, 2],
            ["Математика и информатика", "Алгебра", 2, 3 * 36, 2],
            ["Математика и информатика", "Геометрия", 2, 2 * 36, 2],
            ["Математика и информатика", "Информатика", 5, 1 * 36, 2],
            ["Общественно-научные предметы", "История России", 7, 2 * 36, 2],
            ["Общественно-научные предметы", "Обществознание", 12, 2 * 36, 2],
            ["Общественно-научные предметы", "География", 8, 2 * 36, 2],
            ["Естественно-научные предметы", "Биология", 6, 2 * 36, 2],
            ["Естественно-научные предметы", "Физика", 3, 2 * 36, 2],
            ["Естественно-научные предметы", "Химия", 4, 2 * 36, 2],
            ["Физическая культура", "Физическая культура", 0, 3 * 36, 2],

            ["Русский язык и литература", "Русский язык", 1, 3 * 36, 3],
            ["Иностранный язык", "Английский язык", 9, 3 * 36, 3],
            ["Математика и информатика", "Алгебра", 2, 6 * 36, 3],
            ["Математика и информатика", "Геометрия", 2, 4 * 36, 3],
            ["Математика и информатика", "Информатика", 5, 5 * 36, 3],
            ["Общественно-научные предметы", "История России", 7, 2 * 36, 3],
            ["Естественно-научные предметы", "Физика", 3, 5 * 36, 3],
            ["Физическая культура", "Физическая культура", 0, 3 * 36, 3],

            ["Русский язык и литература", "Русский язык", 1, 6 * 36, 4],
            ["Русский язык и литература", "Литература", 18, 3 * 36, 4],
            ["Иностранный язык", "Английский язык", 9, 2 * 36, 4],
            ["Математика и информатика", "Математика", 2, 5 * 36, 4],
            ["Общественно-научные предметы", "История России", 7, 2 * 36, 4],
            ["Общественно-научные предметы", "Обществознание", 12, 2 * 36, 4],
            ["Общественно-научные предметы", "География", 8, 1 * 36, 4],
            ["Естественно-научные предметы", "Биология", 6, 1 * 36, 4],
            ["Физическая культура", "Физическая культура", 0, 3 * 36, 4],

            ["Русский язык и литература", "Русский язык", 1, 4 * 36, 5],
            ["Русский язык и литература", "Литература", 18, 2 * 36, 5],
            ["Иностранный язык", "Английский язык", 9, 3 * 36, 5],
            ["Математика и информатика", "Алгебра", 2, 3 * 36, 5],
            ["Математика и информатика", "Геометрия", 2, 2 * 36, 5],
            ["Математика и информатика", "Информатика", 5, 1 * 36, 5],
            ["Общественно-научные предметы", "История России", 7, 2 * 36, 5],
            ["Общественно-научные предметы", "Обществознание", 12, 2 * 36, 5],
            ["Общественно-научные предметы", "География", 8, 2 * 36, 5],
            ["Естественно-научные предметы", "Биология", 6, 1 * 36, 5],
            ["Естественно-научные предметы", "Физика", 3, 2 * 36, 5],
            ["Физическая культура", "Физическая культура", 0, 3 * 36, 5],

            ["Русский язык и литература", "Русский язык", 1, 6 * 36, 6],
            ["Русский язык и литература", "Литература", 18, 4 * 36, 6],
            ["Иностранный язык", "Английский язык", 9, 4 * 36, 6],
            ["Математика и информатика", "Алгебра", 2, 3 * 36, 6],
            ["Математика и информатика", "Геометрия", 2, 2 * 36, 6],
            ["Общественно-научные предметы", "История России", 7, 3 * 36, 6],
            ["Общественно-научные предметы", "Обществознание", 12, 4 * 36, 6],
            ["Физическая культура", "Физическая культура", 0, 3 * 36, 6],

            ["Русский язык и литература", "Русский язык", 1, 3 * 36, 7],
            ["Иностранный язык", "Английский язык", 9, 3 * 36, 7],
            ["Математика и информатика", "Алгебра", 2, 6 * 36, 7],
            ["Математика и информатика", "Геометрия", 2, 4 * 36, 7],
            ["Математика и информатика", "Информатика", 5, 5 * 36, 7],
            ["Общественно-научные предметы", "История России", 7, 2 * 36, 7],
            ["Естественно-научные предметы", "Физика", 3, 5 * 36, 7],
            ["Физическая культура", "Физическая культура", 0, 3 * 36, 7]
        ]
    )

    # Teacher
    cursor.executemany(
        '''INSERT INTO "School_schema"."Teacher"(teacher_personnel_number, full_name, birth_date, passport, address, phone, email) 
           VALUES(%s, %s, %s, %s, %s, %s, %s)''',
        [
            [334, "Андреева Светлана Ивановна", date(1962, 4, 12), "4689 852504",
             "г. Иваново, ул. Фридриха-Энгельса, д. 3", "+7 (932) 799-59-29", "andreevaaa@yandex.ru"],
            [121, "Гатальская Наталия Геннадьевна", date(1956, 8, 24), "4850 300601", "г. Иваново, ул. Бубнова, д. 15",
             "+7 (905) 426-91-23", "gatng@gmail.com"],
            [11, "Старовойтова Ольга Александровна", date(1973, 9, 2), "4837 833234",
             "г. Иваново, ул. Комсомольская, д. 1", "+7 (975) 812-52-91", "phy_oa@gmail.com"],
            [215, "Жукова Надежда Генриховна", date(1955, 12, 30), "4155 473447", None, "+7 (920) 870-26-49",
             "zhuck19553@mail.ru"],
            [15, "Малышкина Анастасия Владимировна", date(2001, 7, 4), "4482 659238", None, "+7 (920) 860-26-59",
             "kitty7cat@mail.ru"],
            [64, "Колобков Сергей Валентинович", date(1978, 10, 22), "4339 509873", None, None, None],
            [336, "Мышленник Арсений Геннадьевич", date(1977, 10, 6), "2397 393489", None, "8 (920) 860-00-50",
             "maaaash@mail.ru"],

            # ну хоть так вас увековечу
            [113, "Родоманова Дарья Андреевна", date(1983, 12, 14), "4416 155721", None, None,
             "dashenka1727@gmail.com"],
            [98, "Кузнецова Ксения Дмитриевна", date(1998, 5, 1), "4381 862552", None, None, None],
            [419, "Чернышева Анастасия Вадимовна", date(1996, 5, 23), "2417 939311", None, None, None],
        ]
    )

    # Education
    cursor.executemany(
        '''INSERT INTO "School_schema"."Education"(teacher_personnel_number, diploma, received, education_level, qualifications, specialization) 
           VALUES(%s, %s, %s, %s, %s, %s)''',
        [
            [334, "8950478012833", date(1984, 8, 15), "Бакалавриат", "Экономист-аналитик", "38.03.01 Экономика"],
            [121, "5595629962002", date(1976, 8, 15), "Бакалавриат", "Робототехник",
             "02.03.02 Фундаментальная информатика и информационные технологии"],
            [215, "9957538971664", date(1979, 8, 15), "Магистратура", "Преподаватель русского языка и литературы",
             "45.04.01 Филология"],
            [98, "2429203942484", date(2018, 8, 15), "Среднее профессиональное образование", "Педагог",
             "44.00.00 Образование и педагогические науки"],
            [419, "8237475371204", date(2017, 8, 15), "Бакалавриат", "Аналитик данных",
             "45.03.04 Интеллектуальные системы в гуманитарной сфере"],
            [419, "9723201371204", date(2019, 8, 15), "Магистратура", "Переводчик",
             "58.04.01 Востоковедение и африканистика"]  # пусть хоть в этой БД ты будешь тем, кем хотела...
        ]
    )

    # Class
    cursor.executemany(
        '''INSERT INTO "School_schema"."Class"(class_letter, status, curriculum_id) 
           VALUES(%s, %s, %s)''',
        [
            ["А", "Расформирован", 1],
            ["Б", "Расформирован", 1],
            ["А", "Расформирован", 2],
            ["А", "Формируется", 5],
            ["Б", "Формируется", 5],
            ["А", "Действует", 6],
            ["Б", "Действует", 6],
            ["Б", "Действует", 7]
        ]
    )

    # Student
    cursor.executemany(
        '''INSERT INTO "School_schema"."Student"(student_code, full_name, birth_date, address, phone, email) 
           VALUES(%s, %s, %s, %s, %s, %s)''',
        [
            [12, "Перова Екатерина Витальевна", date(2005, 9, 13), "г. Иваново, ул. Смирнова, д. 15",
             "+7 (932) 325-34-98", "lololo23@mail.ru"],
            [16, "Енотова Ярослава Афанасьевна", date(2005, 9, 25), None,
             "8 (956) 814-12-67", "saveme@yandex.ru"],
            [29, "Хохорин Антон Емельянович", date(2005, 6, 2), None,
             "+7 (968) 707-86-50", "anton77@mail.ru"],
            [19, "Шабалин Александр Васильевич", date(2006, 8, 24), None,
             "+7 (943) 426-33-20", "aleksandr08111976@rambler.ru"],
            [36, "Сигова Александра Аркадьевна", date(2006, 11, 25), None,
             "8 (924) 287-56-69", "aleksandra4492@gmail.com"],
            [76, "Маслюка София Ивановна", date(2007, 3, 5), None,
             "+7 (969) 334-24-85", "sofiya45@ya.ru"],
            [6, "Бородин Игнат Ефимович", date(2008, 4, 14), "г. Иваново, ул. Смирнова, д. 32",
             None, "ignat9318@gmail.com"],
            [42, "Шульгин Константин Вячеславович", date(2009, 3, 16), None,
             None, "konstantin25@yandex.ru"],
            [27, "Колодезева Юлия Романовна", date(2010, 7, 26), None, None,
             None],
            [24, "Каретникова Наталия Максимовна", date(2011, 8, 1), None, None,
             None],
        ]
    )

    # Student_in_class
    cursor.executemany(
        '''INSERT INTO "School_schema"."Student_in_class"(student_code, class_id, date_from, date_to, status) 
           VALUES(%s, %s, %s, %s, %s)''',
        [
            [12, 8, date(2022, 9, 1), date(2023, 8, 30), "В академ. отпуске"],
            [29, 8, date(2022, 9, 1), date(2023, 8, 30), "Числится"],
            [19, 6, date(2022, 9, 1), date(2022, 10, 30), "Отчислен"],
            [16, 7, date(2022, 9, 1), date(2023, 8, 30), "Числится"],
            [19, 3, date(2019, 9, 1), date(2020, 8, 30), "Числился"],
            [36, 7, date(2022, 9, 1), date(2023, 8, 30), "Числится"],
            [76, 3, date(2019, 9, 1), date(2020, 8, 30), "Числился"],
            [42, 5, date(2023, 9, 1), date(2024, 8, 30), "Числится"],
            [27, 5, date(2023, 9, 1), date(2024, 8, 30), "Числится"],
        ]
    )

    # Headstudent
    cursor.executemany(
        '''INSERT INTO "School_schema"."Headstudent"(student_in_class_id, date_from, date_to) 
           VALUES(%s, %s, %s)''',
        [
            [6, date(2022, 9, 1), None],
            [3, date(2022, 9, 30), None],
            [5, date(2019, 9, 1), date(2020, 5, 30)]
        ]
    )

    # Headteacher
    cursor.executemany(
        '''INSERT INTO "School_schema"."Headteacher"(teacher_personnel_number, class_id, date_from, date_to) 
           VALUES(%s, %s, %s, %s)''',
        [
            [121, 3, date(2019, 9, 1), date(2020, 8, 30)],
            [121, 7, date(2022, 9, 1), None],
            [113, 8, date(2022, 10, 3), None]
        ]
    )

    # Classroom
    cursor.executemany(
        '''INSERT INTO "School_schema"."Classroom"(classroom_number, classroom_specialization, having_projector, number_of_seats) 
           VALUES(%s, %s, %s, %s)''',
        [
            [1, "Спортивный зал", False, 0],
            [14, None, False, 30],
            [22, "Физика", True, 30],
            [21, "Химия", True, 32],
            [23, None, False, 32],
            [26, None, True, 32],
            [28, None, None, 32],
            [32, None, False, 18],
            [35, "Информатика", True, 20],
            [42, "Библиотека", None, 4],
            [43, None, False, 32]
        ]
    )


    # Workload
    cursor.executemany(
        '''INSERT INTO "School_schema"."Workload"(hours, date_from, date_to, teacher_personnel_number, class_id, discipline_id)
           VALUES(%s, %s, %s, %s, %s, %s)''',
        [
            [6 * 36, date(2022, 9, 1), date(2023, 8, 30), 215, 6, 50],  # НГ русский у 10А
            [4 * 36, date(2022, 9, 1), date(2023, 8, 30), 215, 6, 51],  # НГ литра у 10А
            [2 * 36, date(2022, 9, 1), date(2022, 12, 31), 113, 6, 52],  # Даша англ у 10А
            [2 * 36, date(2023, 1, 1), date(2023, 8, 30), 98, 6, 52],  # Ксюня англ у 10А
            [3 * 36, date(2022, 9, 1), date(2023, 8, 30), 334, 6, 53],  # СИ матеша у 10А
            [2 * 36, date(2022, 9, 1), date(2023, 8, 30), 334, 6, 54],  # СИ матеша у 10А
            [3 * 36, date(2022, 9, 1), date(2023, 8, 30), 15, 6, 55],  # рандомная тётя история у 10А
            [4 * 36, date(2022, 9, 1), date(2023, 8, 30), 15, 6, 56],  # рандомная тётя общага у 10А
            [3 * 36, date(2022, 9, 1), date(2023, 8, 30), 64, 6, 57],  # физра у 10А

            [3 * 36, date(2022, 9, 1), date(2023, 8, 30), 215, 8, 58],  # НГ русский у 11Б
            [2 * 36, date(2022, 9, 1), date(2022, 12, 31), 98, 8, 59],  # Ксюня англ у 11Б
            [1 * 36, date(2023, 1, 1), date(2023, 8, 30), 113, 8, 59],  # Даша англ у 11Б
            [6 * 36, date(2022, 9, 1), date(2023, 8, 30), 334, 8, 60],  # СИ матеша у 11Б
            [4 * 36, date(2022, 9, 1), date(2023, 8, 30), 334, 8, 61],  # СИ матеша у 11Б
            [5 * 36, date(2022, 9, 1), date(2023, 8, 30), 419, 8, 62],  # Настя инфа у 11Б
            [2 * 36, date(2022, 9, 1), date(2023, 8, 30), 15, 8, 63],  # рандомная тётя история у 11Б
            [5 * 36, date(2022, 9, 1), date(2023, 8, 30), 11, 8, 64],  # ОА физика у 11Б
            [3 * 36, date(2022, 9, 1), date(2023, 8, 30), 64, 8, 57],  # физра у 11Б
        ]
    )

    # Schedule
    cursor.executemany(
        '''INSERT INTO "School_schema"."Schedule"(weekday, lesson_type, date_from, date_to, time_from, time_to, classroom_number, workload_id)
           VALUES(%s, %s, %s, %s, %s, %s, %s, %s)''',
        [
         ["Понедельник", "Основное", date(2022, 9, 1), date(2022, 12, 31), time(8, 0, 0), time(8, 45, 0), 23, 1],  # НГ русский у 10А
         ["Четверг", "Основное", date(2022, 9, 1), date(2022, 12, 31), time(8, 0, 0), time(8, 45, 0), 22, 17],  # ОА физика у 11Б
         ["Вторник", "Основное", date(2022, 9, 1), date(2022, 12, 31), time(10, 0, 0), time(10, 45, 0), 32, 3],  # англ у 10А
         ["Среда", "Основное", date(2022, 9, 1), date(2022, 12, 31), time(9, 0, 0), time(9, 45, 0), 35, 15], # инфа у 11Б
         ["Суббота", "Секция", date(2022, 9, 1), date(2022, 12, 31), time(20, 0, 0), time(21, 0, 0), 1, 18],  # физра у 11Б
        ]
    )

    # Plan
    cursor.executemany(
        '''INSERT INTO "School_schema"."Plan"(topic_name, topic_number, hours_per_topic, workload_id)
           VALUES(%s, %s, %s, %s)''',
        [
            ["Тема 1", 1, 2, 17],  # ОА физика у 11Б
            ["Тема 2", 2, 3, 17],
            ["Тема 3", 3, 2, 17],
            ["Тема 4", 4, 10, 17],

            ["Тема 1", 1, 2, 1],  # НГ русский у 10А
            ["Тема 2", 2, 3, 1],
            ["Тема 3", 3, 8, 1],

            ["Тема 1", 1, 3, 15],  # Настя инфа у 11Б
            ["Тема 2", 2, 5, 15],
            ["Тема 3", 3, 5, 15],
            ["Тема 4", 4, 6, 15],
        ]
    )

    # Lesson
    cursor.executemany(
        '''INSERT INTO "School_schema"."Lesson"(lesson_date, schedule_id)
           VALUES(%s, %s)''',
        [
            [date(2022, 9, 5), 1],
            [date(2022, 9, 12), 1],
            [date(2022, 9, 19), 1],

            [date(2022, 9, 7), 4],
            [date(2022, 9, 14), 4]
        ]
    )

    # EvaluationTool
    cursor.executemany(
        '''INSERT INTO "School_schema"."EvaluationTool"(name, type, description, plan_id)
           VALUES(%s, %s, %s, %s)''',
        [
            ["Лабораторная 1", "С/р", None, 1],
            ["Контрольная по 1 разделу", "К/р", None, 8],
            ["Введение", "Д/з", None, 5],
            [None, "Иное", "Олимпиада", 8],
        ]
    )

    # Attendance
    cursor.executemany(
        '''INSERT INTO "School_schema"."Attendance"(attendance, note, student_in_class_id, lesson_id)
           VALUES(%s, %s, %s, %s)''',
        [
            [False, "Ув.пр.", 3, 1],
            [True, "Перевернул горшок с цветком", 3, 2],
            [True, None, 1, 5],
            [True, None, 2, 4],
            [True, None, 2, 5]
        ]
    )

    # Grade
    cursor.executemany(
        '''INSERT INTO "School_schema"."Grade"(grade, note, attendance_id, evaluation_tool_id)
           VALUES(%s, %s, %s, %s)''',
        [
            [5, None, 2, 3],
            [3, None, 3, 2],
            [4, None, 4, 2],
            [5, "Олимпиада", 5, 4]
        ]
    )

    connection.commit()
    print("Records inserted successfully!")
    session.close()
